<?php

//　1年次で受講

    define('STUDY_1_01', '大学生として必要な学ぶための基礎的な知識やスキルを習得しいる。(Ⅰ類科目・基礎ゼミナール・ソーシャルワーク論)');
    define('STUDY_1_02', '大学生として必要な学ぶための基礎的な態度を獲得しいる。(全科目)');
    define('STUDY_1_03', '福祉マインドに関わる基本的な知識を習得している。(社会福祉入門・社会福祉原論・社会保障論等)');
    define('STUDY_1_04', '福祉マインドに関わる基本的な態度を獲得している。(基礎ゼミナール・ソーシャルワーク演習)※⑧他者と協働し、共生社会構築の役割を担う意欲を持っている。');
    define('STUDY_1_05', 'グループの特性に応じて、適切なリーダーシップやメンバーシップを発揮する姿勢を有している。');
    define('STUDY_1_06', '');

//　2年次で受講
    define('STUDY_2_01', '福祉マインドを持つ人材としての思想や指針となる理論、支援に役立つ知識・技術を理解するために必要な読解力、記述力及び学びの方法を身につけている。');
    define('STUDY_2_02', '学んだことを生かして、自らの生き方及び果たすべき役割や責任について考察を深めることができる。');
    define('STUDY_2_03', '他者と協働し、共生社会構築の役割を担う意欲を持っている。');
    define('STUDY_2_04', '自分自身の言動を振り返り、意識的な変容の意図のもと、自身の成長につなげることができる。');
    define('STUDY_2_05', '');
    define('STUDY_2_06', '');

//　3年次で受講

    define('STUDY_3_01', '福祉マインドを持つ人材としての思想や指針となる理論、支援に役立つ知識・技術を理解するために必要な読解力、記述力及び学びの方法を身につけている。');
    define('STUDY_3_02', '学んだ知識について、自らの考えを他者に対して的確に表現することができる。');
    define('STUDY_3_03', '社会福祉学の学びから学習や研究課題を設定し、主体的に取り組む姿勢を有している。');
    define('STUDY_3_04', '社会福祉学の価値・知識・技術を理解し活用できるよう、日々成果を蓄積しようとする意欲を持っている。');
    define('STUDY_3_05', '');
    define('STUDY_3_06', '');


//　4年次で受講
    define('STUDY_4_01', '地域共生社会の実現に向け、社会福祉学の価値・知識・技術を人と社会に対する支援に活用する方法を身につけている。');
    define('STUDY_4_02', '社会福祉学領域の研究や方法を通じて、地域社会や身近な人々の間で生じている問題を発見し、その解決方法を判断し、改善を図ることができる。');
    define('STUDY_4_03', '知識集約型社会を見据えて、自らの専門分野の学問領域と他の学問領域を統合的に学び、多面的・重層的な思考をすることで、複雑で多様な現代社会の課題に応えることができる。');
    define('STUDY_4_04', '多様な人々の価値観を受け止め、円滑な人間関係を築き、チームアプローチにより目標達成に向けて努力することができる。');
    define('STUDY_4_05', '');
    define('STUDY_4_06', '');




//　2年次で受講

    define('SW1_TARGET_01', '専門職としての倫理（人権用語・守秘義務の尊重）の施政を身につけている');
    define('SW1_TARGET_02', '基本的な仕事上（出勤時間・規則の遵守・連絡・報告等）の任務をはたしている');
    define('SW1_TARGET_03', '積極的・主体的に学習をすすめている');
    define('SW1_TARGET_04', '指導をまじめに受け止めて行動している');
    define('SW1_TARGET_05', '施設・機関の目的及び機能を理解している');
    define('SW1_TARGET_06', '利用者と良い対人関係ができている');
    define('SW1_TARGET_07', '記録を適切に取り、整理・保管・活用している');
    define('SW1_TARGET_08', '自分自身の性格・行動傾向について自覚し、洞察している');
    define('SW1_TARGET_09', '施設・機関の職員やボランティアと良い協力関係ができている');
    define('SW1_TARGET_10', '');
    define('SW1_TARGET_11', '');
    define('SW1_TARGET_12', '');

//　3年次 OR 4年次で受講

    define('SW2_TARGET_01', '専門職としての倫理（人権用語・守秘義務の尊重）の施政を身につけている');
    define('SW2_TARGET_02', '基本的な仕事上（出勤時間・規則の遵守・連絡・報告等）の任務をはたしている');
    define('SW2_TARGET_03', '積極的・主体的に学習をすすめている');
    define('SW2_TARGET_04', '指導をまじめに受け止めて行動している');
    define('SW2_TARGET_05', '施設・機関の目的及び機能を理解している');
    define('SW2_TARGET_06', '施設・機関が地域社会において果たすべき役割を理解している');
    define('SW2_TARGET_07', '利用者を理解し、ニーズを把握している');
    define('SW2_TARGET_08', '利用者と良い人間関係ができている');
    define('SW2_TARGET_09', '個人または集団に対して適切な援助ができている');
    define('SW2_TARGET_10', '記録を適切にとり、整理・保管・活用している');
    define('SW2_TARGET_11', '自分自身の性格・行動傾向について自覚し、洞察している');
    define('SW2_TARGET_12', '施設・機関の職員やボランティアと良い協力関係ができている');
    

    define('IT2_TARGET_01', '①大学側が設定するインターンシップⅠの12項目');
    define('IT2_TARGET_02', '②大学側が設定するインターンシップⅠの12項目');
    define('IT2_TARGET_03', '③大学側が設定するインターンシップⅠの12項目');
    define('IT2_TARGET_04', '④大学側が設定するインターンシップⅠの12項目');
    define('IT2_TARGET_05', '⑤大学側が設定するインターンシップⅠの12項目');
    define('IT2_TARGET_06', '⑥大学側が設定するインターンシップⅠの12項目');
    define('IT2_TARGET_07', '⑦大学側が設定するインターンシップⅠの12項目');
    define('IT2_TARGET_08', '⑧大学側が設定するインターンシップⅠの12項目');
    define('IT2_TARGET_09', '⑨大学側が設定するインターンシップⅠの12項目');
    define('IT2_TARGET_10', '⑩大学側が設定するインターンシップⅠの12項目');
    define('IT2_TARGET_11', '⑪大学側が設定するインターンシップⅠの12項目');
    define('IT2_TARGET_12', '⑫大学側が設定するインターンシップⅠの12項目');

    define('IT3_TARGET_01', '①大学側が設定する精神保健福祉援助インターンシップⅡの12項目');
    define('IT3_TARGET_02', '②大学側が設定する精神保健福祉援助インターンシップⅡの12項目');
    define('IT3_TARGET_03', '③大学側が設定する精神保健福祉援助インターンシップⅡの12項目');
    define('IT3_TARGET_04', '④大学側が設定する精神保健福祉援助インターンシップⅡの12項目');
    define('IT3_TARGET_05', '⑤大学側が設定する精神保健福祉援助インターンシップⅡの12項目');
    define('IT3_TARGET_06', '⑥大学側が設定する精神保健福祉援助インターンシップⅡの12項目');
    define('IT3_TARGET_07', '⑦大学側が設定する精神保健福祉援助インターンシップⅡの12項目');
    define('IT3_TARGET_08', '⑧大学側が設定する精神保健福祉援助インターンシップⅡの12項目');
    define('IT3_TARGET_09', '⑨大学側が設定する精神保健福祉援助インターンシップⅡの12項目');
    define('IT3_TARGET_10', '⑩大学側が設定する精神保健福祉援助インターンシップⅡの12項目');
    define('IT3_TARGET_11', '⑪大学側が設定する精神保健福祉援助インターンシップⅡの12項目');
    define('IT3_TARGET_12', '⑫大学側が設定する精神保健福祉援助インターンシップⅡの12項目');


    define('IT4_TARGET_01', '①大学側が設定するアドバンス・コース／精神実習Ⅱ');
    define('IT4_TARGET_02', '②大学側が設定するアドバンス・コース／精神実習Ⅱ');
    define('IT4_TARGET_03', '③大学側が設定するアドバンス・コース／精神実習Ⅱ');
    define('IT4_TARGET_04', '④大学側が設定するアドバンス・コース／精神実習Ⅱ');
    define('IT4_TARGET_05', '⑤大学側が設定するアドバンス・コース／精神実習Ⅱ');
    define('IT4_TARGET_06', '⑥大学側が設定するアドバンス・コース／精神実習Ⅱ');
    define('IT4_TARGET_07', '⑦大学側が設定するアドバンス・コース／精神実習Ⅱ');
    define('IT4_TARGET_08', '⑧大学側が設定するアドバンス・コース／精神実習Ⅱ');
    define('IT4_TARGET_09', '⑨大学側が設定するアドバンス・コース／精神実習Ⅱ');
    define('IT4_TARGET_10', '⑩大学側が設定するアドバンス・コース／精神実習Ⅱ');
    define('IT4_TARGET_11', '⑪大学側が設定するアドバンス・コース／精神実習Ⅱ');
    define('IT4_TARGET_12', '⑫大学側が設定するアドバンス・コース／精神実習Ⅱ');







    define('MATERIALS1', '障害者理解プログラム①「私たちの学校を案内してみよう！」');
    define('MATERIALS2', '障害者理解プログラム②「いろんなコミュニケーション手段で広がる世界」');
    define('MATERIALS3', '高齢者理解プログラム「つながろう！わたしたちのまちの高齢者」');
    define('MATERIALS4', '認知症理解プログラム「認知症があるってどういうこと？」');
    define('MATERIALS5', '国際理解プログラム赤い羽根共同募金理解プログラム「募金のゆくえ」');
    define('MATERIALS6', '防災のまちづくりプログラム「災害に備えて、わたしたちにできることを考えよう」');
    define('MATERIALS7', '導入・振り返りプログラム「わたしとみんなの“ふだんのくらしのしあわせ”」');
    


    define('SWLF_MENTAL1_01', '①精神保健福祉援助実習Ⅰ_自己評価表　達成目標');
    define('SWLF_MENTAL1_02', '②精神保健福祉援助実習Ⅰ_自己評価表　達成目標');
    define('SWLF_MENTAL1_03', '③精神保健福祉援助実習Ⅰ_自己評価表　達成目標');
    define('SWLF_MENTAL1_04', '④精神保健福祉援助実習Ⅰ_自己評価表　達成目標');
    define('SWLF_MENTAL1_05', '⑤精神保健福祉援助実習Ⅰ_自己評価表　達成目標');
    define('SWLF_MENTAL1_06', '⑥精神保健福祉援助実習Ⅰ_自己評価表　達成目標');
    define('SWLF_MENTAL1_07', '⑦精神保健福祉援助実習Ⅰ_自己評価表　達成目標');
    define('SWLF_MENTAL1_08', '⑧精神保健福祉援助実習Ⅰ_自己評価表　達成目標');
    define('SWLF_MENTAL1_09', '⑨精神保健福祉援助実習Ⅰ_自己評価表　達成目標');
    define('SWLF_MENTAL1_10', '⑩精神保健福祉援助実習Ⅰ_自己評価表　達成目標');
    define('SWLF_MENTAL1_11', '⑪精神保健福祉援助実習Ⅰ_自己評価表　達成目標');
    define('SWLF_MENTAL1_12', '⑫精神保健福祉援助実習Ⅰ_自己評価表　達成目標');

    define('SWLF_MENTAL2_01', '①精神保健福祉援助実習Ⅱ_自己評価表　達成目標');
    define('SWLF_MENTAL2_02', '②精神保健福祉援助実習Ⅱ_自己評価表　達成目標');
    define('SWLF_MENTAL2_03', '③精神保健福祉援助実習Ⅱ_自己評価表　達成目標');
    define('SWLF_MENTAL2_04', '④精神保健福祉援助実習Ⅱ_自己評価表　達成目標');
    define('SWLF_MENTAL2_05', '⑤精神保健福祉援助実習Ⅱ_自己評価表　達成目標');
    define('SWLF_MENTAL2_06', '⑥精神保健福祉援助実習Ⅱ_自己評価表　達成目標');
    define('SWLF_MENTAL2_07', '⑦精神保健福祉援助実習Ⅱ_自己評価表　達成目標');
    define('SWLF_MENTAL2_08', '⑧精神保健福祉援助実習Ⅱ_^自己評価表　達成目標');
    define('SWLF_MENTAL2_09', '⑨精神保健福祉援助実習Ⅱ_自己評価表　達成目標');
    define('SWLF_MENTAL2_10', '⑩精神保健福祉援助実習Ⅱ_自己評価表　達成目標');
    define('SWLF_MENTAL2_11', '⑪精神保健福祉援助実習Ⅱ_自己評価表　達成目標');
    define('SWLF_MENTAL2_12', '⑫精神保健福祉援助実習Ⅱ_自己評価表　達成目標');


    define('SWLF_ADV_01', '①アドバンス・クラス_自己評価表　達成目標');
    define('SWLF_ADV_02', '②アドバンス・クラス_自己評価表　達成目標');
    define('SWLF_ADV_03', '③アドバンス・クラス_自己評価表　達成目標');
    define('SWLF_ADV_04', '④アドバンス・クラス_自己評価表　達成目標');
    define('SWLF_ADV_05', '⑤アドバンス・クラス_自己評価表　達成目標');
    define('SWLF_ADV_06', '⑥アドバンス・クラス_自己評価表　達成目標');
    define('SWLF_ADV_07', '⑦アドバンス・クラス_自己評価表　達成目標');
    define('SWLF_ADV_08', '⑧アドバンス・クラス自己評価表　達成目標');
    define('SWLF_ADV_09', '⑨アドバンス・クラス_自己評価表　達成目標');
    define('SWLF_ADV_10', '⑩アドバンス・クラス_自己評価表　達成目標');
    define('SWLF_ADV_11', '⑪アドバンス・クラス_自己評価表　達成目標');
    define('SWLF_ADV_12', '⑫アドバンス・クラス_自己評価表　達成目標');






/* */